[

["Guth, F., Benedetti, V.L.L. and Schwening, C. (2010) 'Definição de Processo de Testes de Software para Empresa de Desenvolvimento de Sistemas' (Definition of a Software Testing Process for a Software house company) ,  in IEEE STIN."],

["Guth, F., Botelho, S. and Amaral, M. (2013) 'Underwater simulator for robotics applications in high depths', in IEEE OCEANS."],

["Codevilla, F., Guth, F., Botelho, S., Fischer, D., Silveira, L., Drews Jr, P. and Duarte Filho, N. (2013) 'Underwater Feature Point Extraction for Man-Made Structures Inspection."],

["Guth, F.A., Silveira, L., Amaral, M., Botelho, S. and Drews, P. (2013) 'Underwater visual 3D SLAM using a bio-inspired system', in 2013 IEEE Symposium on Computing and Automation for Offshore Shipbuilding, 87-92."],

["Silveira, L., Guth, F., Botelho, S., Drews, P. and Fischer, D. (2013) 'Biological inspired system for localization and mapping in underwater environments', in IEEE OCEANS."],

["Silveira, L., Guth, F., Drews, P. and Botelho, S. (2013) '3D robotic mapping: A biologic approach', in 2013 16th IEEE International Conference on Advanced Robotics (ICAR), 1-6."],

["Guth, F., Botelho, S., Silveira, L., Drews Jr, P. and dos Santos, M.M. (2014) 'Uma proposta de SLAM para veículos subaquáticos' (A SLAM proposal for underwater robots), in Encontro Nacional de Inteligência Artificial e Computacional (ENIAC)."],

["Guth, F., Silveira, L., Botelho, S. and Drews, P. (2014) 'Challenges and state-of-the-art solutions to underwater SLAM', in 2014 IEEE Symposium on Automation and Computation for Naval, Offshore and Subsea (NAVCOMP), 10-13."],

["Guth, F., Silveira, L., Botelho, S., Drews, P. and Ballester, P. (2014) 'Underwater SLAM: Challenges, state of the art, algorithms and a new biologically-inspired approach', in 5th IEEE RAS/EMBS International Conference on Biomedical Robotics and Biomechatronics,, 981-986."],

["Silveira, L., Guth, F., Drews-Jr, P., Ballester, P., Machado, M., Codevilla, F., Duarte-Filho, N. and Botelho, S. (2015) 'An Open-source Bio-inspired Solution to Underwater SLAM', IFAC, 48(2), 212-217."],

["Guth, F.A., Ward, S. and McDonnell, K.P. (2016) 'Intelligent Systems Applied to Crop Assessment And Production', Biosystems and Food Engineering Research Review, (21), 127."],

["Guth, F.A., Ward, S. and McDonnell, K.P. (2017) 'A Review of Machine Learning Towards Precision Agriculture in Crop Production', Journal of Environmental Science, Computer Science and Engineering & Technology, 6(4), 492-510."],

["Guth, F.A., Ward, S. and McDonnell, K.P. (2017) 'Autonomous disease detection in crops using deep learning', Biosystems and Food Engineering Research Review, (22), 209."],

["Guth, F.A., Ward, S. and McDonnell, K.P. (2017) 'Autonomous Winter Wheat Variety Selection System', Journal of Advanced Agricultural Technologies Vol, 4(2)."],

["Guth, F., Ward, S. and McDonnell, K. (2018) 'Disease level assessment in crop plots using RGB images and deep learning algorithms', Biosystems and Food Engineering Research Review, (23), 148."],


["Guth, F., Ward, S. and McDonnell, K. (2021) 'Septoria tritici disease quantification in winter wheat ', (In review)."],

["Guth, F., Ward, S. and McDonnell, K. (2021) 'An assessment of the translation of convolutional neural networks from laboratory practices to field applications for crop disease detection', (In review)."]


]



